Revit 2027 API
BuiltInFailures.StairRampFailures.RunBottomUnderStairsBottomFailure Property
 Run bottom elevation should not be below the stairs bottom elevation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RunBottomUnderStairsBottomFailure { get; }
Public Shared ReadOnly Property RunBottomUnderStairsBottomFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RunBottomUnderStairsBottomFailure {
	FailureDefinitionId^ get ();
}
static member RunBottomUnderStairsBottomFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace